# 10

In [26]:
import pandas as pd

In [27]:
df = pd.read_csv('../data/popular-names.txt', sep='\t', header=None)
print(len(df))
display(df)

2780

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
2775   Benjamin  M  13381  2018
2776     Elijah  M  12886  2018
2777      Lucas  M  12585  2018
2778      Mason  M  12435  2018
2779      Logan  M  12352  2018

[2780 rows x 4 columns]

In [28]:
!wc --lines ../data/popular-names.txt

2780 ../data/popular-names.txt

# 11

In [29]:
df.to_csv('../data/popular-names-space.txt',header=None,sep=' ')

# 12

In [30]:
df.loc[:,0].to_csv('../data/col1.txt',header=None, index=None)
df.loc[:,1].to_csv('../data/col2.txt',header=None, index=None)

# 13

In [31]:
df1 = pd.read_csv('../data/col1.txt',header=None)
df2 = pd.read_csv('../data/col2.txt',header=None)
df1_2 = pd.concat([df1,df2],axis=1)
display(df1_2)
df1_2.to_csv('../data/col1_2.txt', header=None, index=None, sep='\t')

              0  0
0          Mary  F
1          Anna  F
2          Emma  F
3     Elizabeth  F
4        Minnie  F
...         ... ..
2775   Benjamin  M
2776     Elijah  M
2777      Lucas  M
2778      Mason  M
2779      Logan  M

[2780 rows x 2 columns]

# 14

In [32]:
n = 5
print(df.head(n))

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

# 15

In [33]:
print(df.tail(n))

             0  1      2     3
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

# 16

In [34]:
lines = len(df)
# print(lines)
def split_files(df,n):
    lines_in_file = int(lines/n)
    print(lines_in_file*n)
    for i in range(n-1):
        df_splited = df.iloc[i*lines_in_file:(i+1)*lines_in_file,:]
        display(df_splited)
    df_splited_last = df.iloc[(n-1)*lines_in_file:,:]
    display(df_splited_last)

split_files(df,3)

2778

             0  1      2     3
0         Mary  F   7065  1880
1         Anna  F   2604  1880
2         Emma  F   2003  1880
3    Elizabeth  F   1939  1880
4       Minnie  F   1746  1880
..         ... ..    ...   ...
921    Dorothy  F  36617  1926
922      Betty  F  32964  1926
923      Helen  F  26884  1926
924   Margaret  F  23070  1926
925       Ruth  F  20223  1926

[926 rows x 4 columns]

                0  1      2     3
926         Doris  F  16298  1926
927      Virginia  F  16162  1926
928       Mildred  F  13551  1926
929       Frances  F  13355  1926
930        Robert  M  61130  1926
...           ... ..    ...   ...
1847    Stephanie  F  16885  1972
1848      Heather  F  16321  1972
1849       Nicole  F  15752  1972
1850      Michael  M  71405  1972
1851  Christopher  M  52189  1972

[926 rows x 4 columns]

             0  1      2     3
1852     James  M  47083  1972
1853     David  M  46366  1972
1854      John  M  43181  1972
1855    Robert  M  43037  1972
1856     Jason  M  37446  1972
...        ... ..    ...   ...
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

[928 rows x 4 columns]

# 17

In [35]:
print(df.iloc[:,0].unique())

['Mary' 'Anna' 'Emma' 'Elizabeth' 'Minnie' 'Margaret' 'Ida' 'Alice'
 'Bertha' 'Sarah' 'John' 'William' 'James' 'Charles' 'George' 'Frank'
 'Joseph' 'Thomas' 'Henry' 'Robert' 'Annie' 'Edward' 'Clara' 'Florence'
 'Ethel' 'Bessie' 'Harry' 'Helen' 'Ruth' 'Marie' 'Lillian' 'Mildred'
 'Dorothy' 'Frances' 'Walter' 'Evelyn' 'Virginia' 'Richard' 'Betty'
 'Donald' 'Doris' 'Shirley' 'Barbara' 'Patricia' 'Joan' 'Nancy' 'Carol'
 'David' 'Ronald' 'Judith' 'Linda' 'Sandra' 'Carolyn' 'Sharon' 'Michael'
 'Susan' 'Donna' 'Larry' 'Kathleen' 'Deborah' 'Gary' 'Karen' 'Debra'
 'Pamela' 'Cynthia' 'Mark' 'Steven' 'Lisa' 'Jeffrey' 'Lori' 'Kimberly'
 'Tammy' 'Angela' 'Michelle' 'Jennifer' 'Melissa' 'Christopher' 'Brian'
 'Amy' 'Laura' 'Tracy' 'Julie' 'Jason' 'Scott' 'Stephanie' 'Heather'
 'Nicole' 'Matthew' 'Rebecca' 'Jessica' 'Amanda' 'Daniel' 'Kelly' 'Joshua'
 'Crystal' 'Ashley' 'Megan' 'Brittany' 'Andrew' 'Justin' 'Samantha'
 'Lauren' 'Emily' 'Brandon' 'Tyler' 'Taylor' 'Nicholas' 'Jacob' 'Hannah'
 'Austin' 'Alexis' 'Rachel' 'Madison' 'Abigail' 'Olivia' 'Ethan' 'Anthony'
 'Isabella' 'Ava' 'Sophia' 'Chloe' 'Alexander' 'Mia' 'Jayden' 'Noah'
 'Aiden' 'Mason' 'Liam' 'Charlotte' 'Harper' 'Benjamin' 'Elijah' 'Amelia'
 'Logan' 'Oliver' 'Lucas']

# 18

In [36]:
print(df.sort_values(by=[2],ascending=True))

            0  1      2     3
9       Sarah  F   1288  1880
29      Alice  F   1308  1881
8      Bertha  F   1320  1880
28     Bertha  F   1324  1881
27      Annie  F   1326  1881
...       ... ..    ...   ...
1351   Robert  M  91640  1947
1550  Michael  M  92704  1957
1350    James  M  94757  1947
1360    Linda  F  96211  1948
1340    Linda  F  99689  1947

[2780 rows x 4 columns]

# 19

In [37]:
print(df.iloc[:,0].value_counts())

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Scott        1
Rachel       1
Kelly        1
Crystal      1
Lucas        1
Name: 0, Length: 136, dtype: int64